# 1. Реализовать вывод информации о промежутке времени в зависимости от его продолжительности duration в секундах:
# до минуты: <s> сек; до часа: <m> мин <s> сек; до суток: <h> час <m> мин <s> сек;
# * в остальных случаях: <d> дн <h> час <m> мин <s> сек.

sec = int(input("duration = "))
if not sec // 60:
    print(sec + " сек")
elif not sec // 60 ** 2:
    print(str(sec // 60) + " мин " + str(sec % 60) + " сек")
elif not sec // (60 ** 2 * 24):
    print(str(sec // 3600) + " час " + str((sec % 3600) // 60) + " мин " + str((sec % 3600) % 60) + " сек")
else:
    day = sec // (60 ** 2 * 24)
    hour = (sec % (60 ** 2 * 24)) // 3600
    minute = ((sec % (60 ** 2 * 24)) % 3600) // 60
    sec = ((sec % (60 ** 2 * 24)) % 3600) % 60
    print(str(day) + " дн " + str(hour) + " час " + str(minute) + " мин " + str(sec) + " сек")
